[{"term":"HTML","definition":"HyperText Markup Language","summary":"HTML (Hypertext Markup Language) is a markup language used to create the structure and content of web pages. It provides a way to mark up text and images with tags and attributes, which define how they should be displayed on a web page. HTML is a foundational language of the web, and is used to create the basic structure of every website."},{"term":"CSS","definition":"Cascading Style Sheets","summary":"CSS (Cascading Style Sheets) is a style sheet language used to describe the presentation of web pages, including the layout, colors, fonts, and other visual aspects. CSS works in conjunction with HTML to style the content on a web page, separating the presentation from the content. With CSS, web developers can create beautiful and responsive web designs that look great on any device."},{"term":"PHP","definition":"HyperText Preprocessor","summary":"PHP (Hypertext Preprocessor) is a server-side scripting language used to create dynamic web pages and web applications. It is executed on the server, generating HTML code that is sent to the user's web browser. PHP can be used to connect to databases, authenticate users, process forms, and perform a wide range of other server-side tasks. It is a powerful language for building complex web applications."},{"term":"JSON","definition":"JavaScript Object Notation","summary":"JSON is an open standard file format and data interchange format that uses human-readable text to store and transmit data objects consisting of attribute–value pairs and arrays. It is a common data format with diverse uses in electronic data interchange, including that of web applications with servers."},{"term":"XML","definition":"Extensible Markup Language","summary":"markup language used for creating documents that contain structured data. It is composed of elements defined by tags, which can contain other elements and attributes. XML is highly extensible and can be used to define custom tags and data structures. It is a popular choice for data exchange between different software systems, document markup, and configuration files in enterprise software systems."},{"term":"YAML","definition":"Yet Another Markup Language","summary":"YAML is a human-readable data serialization language that is often used for writing configuration files. \r\nYAML is a popular programming language because it is designed to be easy to read and understand. It can also be used in conjunction with other programming languages. Because of its flexibility and accessibility, YAML is used by the Ansible automation tool to create automation processes, in the form of Ansible Playbooks."}]